W7D2/music-app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "IwUaYNI2TQk3eMYQ7xs6Mg"], ["LIMIT", 1]]
---
  def self.find_by_session_token(token)
    User.find_by(session_token: token)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "abcdef"], ["LIMIT", 1]]
---
  def self.find_with_password(params)
    user = User.find_by(email: params[:email])