W8D1/reddit_clone/app/controllers/users_controller.rb

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    @user = self.current_user
    @user.destroy