W5D4/URL_Shortener/app/models/shortened_url.rb

    def self.random_code
        while true
            code = SecureRandom.urlsafe_base64
            return code unless ShortenedUrl.exists?(short_url:code)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "c7Iq40XH-3tUXcerBRoG8Q"], ["LIMIT", 1]]

    def self.create!(user, long_url)
        short_url = self.random_code
        instance = ShortenedUrl.new(long_url: long_url , short_url: short_url, user_id: user.id)
        p [long_url, short_url, user.id]
        instance.save!
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "google.com"], ["short_url", "YoKOQeVBtauyS5oOufWV6g"], ["created_at", "2021-02-19 03:53:54.473641"], ["updated_at", "2021-02-19 03:53:54.473641"], ["user_id", 2]]