W6D5/Cats99/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def self.find_by_credentials(user_name, pwd)
    user = User.find_by(user_name: user_name)