W6D5/Cats99/app/controllers/application_controller.rb

SELECT COUNT(*) FROM "cats"
---
  def initialize(*args)
    @cat_count = Cat.count