W6D5/Cats99/app/controllers/users_controller.rb

  def create
    #use data from sign up form to create a new user;
    #log in
    #then redirect to the cats index page
    @user = User.create(strong_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "zejAyyixG63GuKhCXG6_Cg"], ["updated_at", "2021-03-02 02:35:45.958914"], ["id", 1]]