W8D1/reddit_clone/app/models/user.rb

  def self.find_by_credentials(username, password = nil)

    @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bunny@gmail.com"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom::base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "0TBOHTEN0RXdsAYmoa4dHA=="], ["updated_at", "2021-03-08 19:55:38.938865"], ["id", 1]]