W6D3/FirstRouterController/app/controllers/artworks_controller.rb

  def index
    user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]