W6D3/FirstRouterController/app/controllers/artwork_shares_controller.rb

  def create
    artwork_share = ArtworkShare.new(strong_params)

    if artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 20], ["created_at", "2021-02-25 21:42:51.370515"], ["updated_at", "2021-02-25 21:42:51.370515"]]

  def delete_by_strong_params
    artwork_id = strong_params[:artwork_id]
    viewer_id = strong_params[:viewer_id]
    artwork_share = ArtworkShare.find_by(artwork_id: artwork_id, viewer_id: viewer_id)

    if artwork_share
      if (artwork_share.destroy)
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."artwork_id" = $1 AND "artwork_shares"."viewer_id" = $2 LIMIT $3  [["artwork_id", 1], ["viewer_id", 20], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 796]]