W6D3/FirstRouterController/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "\"It is great.\""], ["author_id", 1], ["artwork_id", 1], ["created_at", "2021-02-25 23:09:55.839710"], ["updated_at", "2021-02-25 23:09:55.839710"]]
---
  def create
    comment = Comment.new(strong_params_for_create)

    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 AND "comments"."author_id" = $2 LIMIT $3  [["artwork_id", 1], ["author_id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
  def destroy_by_strong_params
    artwork_id = strong_params[:artwork_id]
    author_id = strong_params[:author_id]
    comment = Comment.find_by(artwork_id: artwork_id, author_id: author_id)

    if comment
      if (comment.destroy)