W6D3/FirstRouterController/app/controllers/likes_controller.rb

    def like
        liker_id = params[:id]
        type = strongparams[:type]
        likee_id = strongparams[:id]
        # artwork = Artwork.find_by(id: params[:artwork_id])
        # comment = Comment.find_by(id: params[:comment_id])
        if type.downcase == 'artwork'

            like = Like.new(liker_id: liker_id, likee: Artwork.find_by(id: likee_id))
        elsif type.downcase == "comment"
            like = Like.new(liker_id: liker_id, likee: Comment.find_by(id: likee_id))
        end
        if like
            if like.save
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "likes" ("likee_type", "likee_id", "liker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likee_type", "Artwork"], ["likee_id", 2], ["liker_id", 10], ["created_at", "2021-02-26 00:57:25.376821"], ["updated_at", "2021-02-26 00:57:25.376821"]]

    def unlike
        liker_id = params[:id]
        type = strongparams[:type]
        likee_id = strongparams[:id]
        # artwork = Artwork.find_by(id: params[:artwork_id])
        # comment = Comment.find_by(id: params[:comment_id])
        if type.downcase == 'artwork'

            like = Like.find_by(liker_id: liker_id, likee: Artwork.find_by(id: likee_id))
        elsif type.downcase == "comment"
            like = Like.find_by(liker_id: liker_id, likee: Comment.find_by(id: likee_id))
        end
        if like
            if like.destroy
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 5]]