W6D3/FirstRouterController/app/controllers/users_controller.rb

  def destroy
    user = User.find_by(id: params[:id])

    if user
      user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]