W6D3/FirstRouterController/app/controllers/users_controller.rb

  def index

    if params[:name]
      users = User.where("username LIKE ?", "%#{params[:name]}%")
      render json: users
    else
      render json: User.all
---
SELECT "users"."id" FROM "users" WHERE "users"."username" = $1  [["username", "Matisse"]]
SELECT "users".* FROM "users"

  def update
    user = User.find_by(id: params[:id])

    if user
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "kitten"], ["email", "kitten@gmail.com"], ["updated_at", "2021-02-24 23:13:12.047918"], ["id", 1]]